app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"
---
  def index
    if params[:author_id]
      @posts = Author.find(params[:author_id]).posts
    else
      @posts = Post.all

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]
---
  def show
    if params[:author_id]
      @post = Author.find(params[:author_id]).posts.find(params[:id])

SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"
---
  def new
    if params[:author_id] && !Author.exists?(params[:author_id])

INSERT INTO "posts" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Asdfasd"], ["description", "asdfasdfasdf"], ["author_id", 1], ["created_at", "2016-02-01 05:49:17.037502"], ["updated_at", "2016-02-01 05:49:17.037502"]]
---
  def create
    @post = Post.new(post_params)
    @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "all you need to know avout js development "], ["updated_at", "2018-03-21 16:27:50.802581"], ["id", 17]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(params.require(:post))

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 123456]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]
---
  def edit
    if params[:author_id]
      author = Author.find(params[:author_id])
      if author.nil?
        redirect_to authors_path, alert: "Author not found"
      else
        @post = author.posts.find(params[:id])